
#Использовать asserts
#Использовать cmdline

#Использовать "../src"

Функция ПолучитьСписокТестов(МенеджерТестирования) Экспорт
    
    МассивТестов = Новый Массив;
    МассивТестов.Добавить("СтатусыКомандСоответствуютЧисловымКодам");
	МассивТестов.Добавить("КомандыДобавленыВПарсерАргументов");
    
    Возврат МассивТестов;
    
КонецФункции

Процедура СтатусыКомандСоответствуютЧисловымКодам() Экспорт

	РезультатыКоманд = МенеджерКомандПриложения.РезультатыКоманд();
	
	Ожидаем.Что(МенеджерКомандПриложения.КодВозвратаКоманды(РезультатыКоманд.НеРеализовано)).Равно(255);
	Ожидаем.Что(МенеджерКомандПриложения.КодВозвратаКоманды(РезультатыКоманд.Успех)).Равно(0);
	Ожидаем.Что(МенеджерКомандПриложения.КодВозвратаКоманды(РезультатыКоманд.НеверныеПараметры)).Равно(5);
	Ожидаем.Что(МенеджерКомандПриложения.КодВозвратаКоманды(РезультатыКоманд.ОшибкаВремениВыполнения)).Равно(1);

КонецПроцедуры

Процедура КомандыДобавленыВПарсерАргументов() Экспорт
	
	Парсер = Новый ПарсерАргументовКоманднойСтроки;
	МенеджерКомандПриложения.ЗарегистрироватьКоманды(Парсер);
	
	Команды = Парсер.СправкаВозможныеКоманды();
	
	МассивКоманд = Команды.ВыгрузитьКолонку("Команда");
	
	Ожидаем.Что(МассивКоманд).Содержит("help");
	
	Команда = МенеджерКомандПриложения.ПолучитьКоманду("help");
	Ожидаем.Что(Команда).ИмеетТип("КомандаСправкаПоПараметрам");
	
КонецПроцедуры
