
#Использовать asserts

#Использовать "../src"

Функция ПолучитьСписокТестов(МенеджерТестирования) Экспорт
    
    МассивТестов = Новый Массив;
    МассивТестов.Добавить("Тест_ДолженПрочитатьСписокОбъектов");
	
    Возврат МассивТестов;
    
КонецФункции

Процедура Тест_ДолженПрочитатьСписокОбъектов() Экспорт
    
    СерверАдминистрирования = Новый СерверАдминистрирования;
    
    Поток = 
    "id : 123
    |name   : somename
    |value  : somevalue
    |
    |id : 125
    |name   : somename1
    |value  : somevalue1
    |
    |
    |";
    
    Результат = СерверАдминистрирования.РазобратьПоток(Поток);
    
    Ожидаем.Что(Результат).ИмеетТип("Массив");
    Ожидаем.Что(Результат.Количество()).Равно(2);
    
    Объект = Результат[0];
    Ожидаем.Что(Объект).ИмеетТип("Соответствие");
    Ожидаем.Что(Объект.Количество(), "Первый объект").Равно(3);
    
    Ожидаем.Что(Объект["id"]).Равно("123");
    Ожидаем.Что(Объект["name"]).Равно("somename");
    Ожидаем.Что(Объект["value"]).Равно("somevalue");
    
    Объект = Результат[1];
    Ожидаем.Что(Объект).ИмеетТип("Соответствие");
    Ожидаем.Что(Объект.Количество(), "Второй объект").Равно(3);
    
    Ожидаем.Что(Объект["id"]).Равно("125");
    Ожидаем.Что(Объект["name"]).Равно("somename1");
    Ожидаем.Что(Объект["value"]).Равно("somevalue1");
    
КонецПроцедуры
